; ModuleID = 'flat.c'
source_filename = "flat.c"
target datalayout = "e-m:e-p:64:64-i64:64-i128:128-n32:64-S128"
target triple = "bpf"

@flat.____fmt = internal constant [15 x i8] c"Got a Packet!\0A\00", align 1, !dbg !0
@_license = dso_local global [4 x i8] c"GPL\00", section "license", align 1, !dbg !128
@llvm.compiler.used = appending global [2 x ptr] [ptr @_license, ptr @flat], section "llvm.metadata"

; Function Attrs: nounwind
define dso_local noundef i32 @flat(ptr nocapture readnone %0) #0 section "tc" !dbg !2 {
    #dbg_value(ptr poison, !132, !DIExpression(), !142)
  %2 = tail call i64 (ptr, i32, ...) inttoptr (i64 6 to ptr)(ptr noundef nonnull @flat.____fmt, i32 noundef 15) #1, !dbg !143
  ret i32 0, !dbg !145
}

attributes #0 = { nounwind "frame-pointer"="all" "no-trapping-math"="true" "stack-protector-buffer-size"="8" }
attributes #1 = { nounwind }

!llvm.dbg.cu = !{!115}
!llvm.module.flags = !{!136, !137, !138, !139, !140}
!llvm.ident = !{!141}

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "____fmt", scope: !2, file: !3, line: 10, type: !133, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "flat", scope: !3, file: !3, line: 9, type: !4, scopeLine: 9, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !115, retainedNodes: !131)
!3 = !DIFile(filename: "flat.c", directory: "/Users/cassamajor/code/flat/bpf", checksumkind: CSK_MD5, checksum: "a6f7e5122e37611d7851a825a61ffcf5")
!4 = !DISubroutineType(types: !5)
!5 = !{!6, !7}
!6 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!8 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sk_buff", file: !9, line: 6229, size: 1536, elements: !10)
!9 = !DIFile(filename: "/usr/include/linux/bpf.h", directory: "", checksumkind: CSK_MD5, checksum: "eec04c95b9f59f758a8270a58c2ff5f6")
!10 = !{!11, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !30, !31, !32, !33, !34, !35, !36, !37, !38, !42, !43, !44, !45, !46, !85, !88, !89, !90, !112, !113, !114}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !8, file: !9, line: 6230, baseType: !12, size: 32)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !13, line: 27, baseType: !14)
!13 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "", checksumkind: CSK_MD5, checksum: "b810f270733e106319b67ef512c6246e")
!14 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_type", scope: !8, file: !9, line: 6231, baseType: !12, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !8, file: !9, line: 6232, baseType: !12, size: 32, offset: 64)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "queue_mapping", scope: !8, file: !9, line: 6233, baseType: !12, size: 32, offset: 96)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !8, file: !9, line: 6234, baseType: !12, size: 32, offset: 128)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_present", scope: !8, file: !9, line: 6235, baseType: !12, size: 32, offset: 160)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_tci", scope: !8, file: !9, line: 6236, baseType: !12, size: 32, offset: 192)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_proto", scope: !8, file: !9, line: 6237, baseType: !12, size: 32, offset: 224)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !8, file: !9, line: 6238, baseType: !12, size: 32, offset: 256)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "ingress_ifindex", scope: !8, file: !9, line: 6239, baseType: !12, size: 32, offset: 288)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "ifindex", scope: !8, file: !9, line: 6240, baseType: !12, size: 32, offset: 320)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "tc_index", scope: !8, file: !9, line: 6241, baseType: !12, size: 32, offset: 352)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !8, file: !9, line: 6242, baseType: !27, size: 160, offset: 384)
!27 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 160, elements: !28)
!28 = !{!29}
!29 = !DISubrange(count: 5)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !8, file: !9, line: 6243, baseType: !12, size: 32, offset: 544)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "tc_classid", scope: !8, file: !9, line: 6244, baseType: !12, size: 32, offset: 576)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !8, file: !9, line: 6245, baseType: !12, size: 32, offset: 608)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "data_end", scope: !8, file: !9, line: 6246, baseType: !12, size: 32, offset: 640)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "napi_id", scope: !8, file: !9, line: 6247, baseType: !12, size: 32, offset: 672)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !8, file: !9, line: 6250, baseType: !12, size: 32, offset: 704)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "remote_ip4", scope: !8, file: !9, line: 6251, baseType: !12, size: 32, offset: 736)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "local_ip4", scope: !8, file: !9, line: 6252, baseType: !12, size: 32, offset: 768)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "remote_ip6", scope: !8, file: !9, line: 6253, baseType: !39, size: 128, offset: 800)
!39 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 128, elements: !40)
!40 = !{!41}
!41 = !DISubrange(count: 4)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "local_ip6", scope: !8, file: !9, line: 6254, baseType: !39, size: 128, offset: 928)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "remote_port", scope: !8, file: !9, line: 6255, baseType: !12, size: 32, offset: 1056)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "local_port", scope: !8, file: !9, line: 6256, baseType: !12, size: 32, offset: 1088)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "data_meta", scope: !8, file: !9, line: 6259, baseType: !12, size: 32, offset: 1120)
!46 = !DIDerivedType(tag: DW_TAG_member, scope: !8, file: !9, line: 6260, baseType: !47, size: 64, align: 64, offset: 1152)
!47 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !8, file: !9, line: 6260, size: 64, align: 64, elements: !48)
!48 = !{!49}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "flow_keys", scope: !47, file: !9, line: 6260, baseType: !50, size: 64)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_flow_keys", file: !9, line: 7271, size: 448, elements: !52)
!52 = !{!53, !56, !57, !58, !61, !62, !63, !64, !67, !68, !69, !83, !84}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "nhoff", scope: !51, file: !9, line: 7272, baseType: !54, size: 16)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !13, line: 24, baseType: !55)
!55 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "thoff", scope: !51, file: !9, line: 7273, baseType: !54, size: 16, offset: 16)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "addr_proto", scope: !51, file: !9, line: 7274, baseType: !54, size: 16, offset: 32)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "is_frag", scope: !51, file: !9, line: 7275, baseType: !59, size: 8, offset: 48)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !13, line: 21, baseType: !60)
!60 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "is_first_frag", scope: !51, file: !9, line: 7276, baseType: !59, size: 8, offset: 56)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "is_encap", scope: !51, file: !9, line: 7277, baseType: !59, size: 8, offset: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "ip_proto", scope: !51, file: !9, line: 7278, baseType: !59, size: 8, offset: 72)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "n_proto", scope: !51, file: !9, line: 7279, baseType: !65, size: 16, offset: 80)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !66, line: 32, baseType: !54)
!66 = !DIFile(filename: "/usr/include/linux/types.h", directory: "", checksumkind: CSK_MD5, checksum: "bf9fbc0e8f60927fef9d8917535375a6")
!67 = !DIDerivedType(tag: DW_TAG_member, name: "sport", scope: !51, file: !9, line: 7280, baseType: !65, size: 16, offset: 96)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "dport", scope: !51, file: !9, line: 7281, baseType: !65, size: 16, offset: 112)
!69 = !DIDerivedType(tag: DW_TAG_member, scope: !51, file: !9, line: 7282, baseType: !70, size: 256, offset: 128)
!70 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !51, file: !9, line: 7282, size: 256, elements: !71)
!71 = !{!72, !78}
!72 = !DIDerivedType(tag: DW_TAG_member, scope: !70, file: !9, line: 7283, baseType: !73, size: 64)
!73 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !70, file: !9, line: 7283, size: 64, elements: !74)
!74 = !{!75, !77}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4_src", scope: !73, file: !9, line: 7284, baseType: !76, size: 32)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be32", file: !66, line: 34, baseType: !12)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4_dst", scope: !73, file: !9, line: 7285, baseType: !76, size: 32, offset: 32)
!78 = !DIDerivedType(tag: DW_TAG_member, scope: !70, file: !9, line: 7287, baseType: !79, size: 256)
!79 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !70, file: !9, line: 7287, size: 256, elements: !80)
!80 = !{!81, !82}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6_src", scope: !79, file: !9, line: 7288, baseType: !39, size: 128)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6_dst", scope: !79, file: !9, line: 7289, baseType: !39, size: 128, offset: 128)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !51, file: !9, line: 7292, baseType: !12, size: 32, offset: 384)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "flow_label", scope: !51, file: !9, line: 7293, baseType: !76, size: 32, offset: 416)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "tstamp", scope: !8, file: !9, line: 6261, baseType: !86, size: 64, offset: 1216)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !13, line: 31, baseType: !87)
!87 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "wire_len", scope: !8, file: !9, line: 6262, baseType: !12, size: 32, offset: 1280)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "gso_segs", scope: !8, file: !9, line: 6263, baseType: !12, size: 32, offset: 1312)
!90 = !DIDerivedType(tag: DW_TAG_member, scope: !8, file: !9, line: 6264, baseType: !91, size: 64, align: 64, offset: 1344)
!91 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !8, file: !9, line: 6264, size: 64, align: 64, elements: !92)
!92 = !{!93}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "sk", scope: !91, file: !9, line: 6264, baseType: !94, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_sock", file: !9, line: 6333, size: 640, elements: !96)
!96 = !{!97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "bound_dev_if", scope: !95, file: !9, line: 6334, baseType: !12, size: 32)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !95, file: !9, line: 6335, baseType: !12, size: 32, offset: 32)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !95, file: !9, line: 6336, baseType: !12, size: 32, offset: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !95, file: !9, line: 6337, baseType: !12, size: 32, offset: 96)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !95, file: !9, line: 6338, baseType: !12, size: 32, offset: 128)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !95, file: !9, line: 6339, baseType: !12, size: 32, offset: 160)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "src_ip4", scope: !95, file: !9, line: 6341, baseType: !12, size: 32, offset: 192)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "src_ip6", scope: !95, file: !9, line: 6342, baseType: !39, size: 128, offset: 224)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "src_port", scope: !95, file: !9, line: 6343, baseType: !12, size: 32, offset: 352)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "dst_port", scope: !95, file: !9, line: 6344, baseType: !65, size: 16, offset: 384)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "dst_ip4", scope: !95, file: !9, line: 6346, baseType: !12, size: 32, offset: 416)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "dst_ip6", scope: !95, file: !9, line: 6347, baseType: !39, size: 128, offset: 448)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !95, file: !9, line: 6348, baseType: !12, size: 32, offset: 576)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "rx_queue_mapping", scope: !95, file: !9, line: 6349, baseType: !111, size: 32, offset: 608)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s32", file: !13, line: 26, baseType: !6)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "gso_size", scope: !8, file: !9, line: 6265, baseType: !12, size: 32, offset: 1408)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "tstamp_type", scope: !8, file: !9, line: 6266, baseType: !59, size: 8, offset: 1440)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "hwtstamp", scope: !8, file: !9, line: 6268, baseType: !86, size: 64, offset: 1472)
!115 = distinct !DICompileUnit(language: DW_LANG_C11, file: !3, producer: "Ubuntu clang version 19.1.1 (1ubuntu1)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !116, splitDebugInlining: false, nameTableKind: None)
!116 = !{!0, !117, !128}
!117 = !DIGlobalVariableExpression(var: !118, expr: !DIExpression())
!118 = distinct !DIGlobalVariable(name: "bpf_trace_printk", scope: !115, file: !119, line: 177, type: !120, isLocal: true, isDefinition: true)
!119 = !DIFile(filename: "/usr/include/bpf/bpf_helper_defs.h", directory: "", checksumkind: CSK_MD5, checksum: "65e4dc8e3121f91a5c2c9eb8563c5692")
!120 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !121)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DISubroutineType(types: !123)
!123 = !{!124, !125, !12, null}
!124 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !127)
!127 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!128 = !DIGlobalVariableExpression(var: !129, expr: !DIExpression())
!129 = distinct !DIGlobalVariable(name: "_license", scope: !115, file: !3, line: 15, type: !130, isLocal: false, isDefinition: true)
!130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !127, size: 32, elements: !40)
!131 = !{!132}
!132 = !DILocalVariable(name: "skb", arg: 1, scope: !2, file: !3, line: 9, type: !7)
!133 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 120, elements: !134)
!134 = !{!135}
!135 = !DISubrange(count: 15)
!136 = !{i32 7, !"Dwarf Version", i32 5}
!137 = !{i32 2, !"Debug Info Version", i32 3}
!138 = !{i32 1, !"wchar_size", i32 4}
!139 = !{i32 7, !"frame-pointer", i32 2}
!140 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!141 = !{!"Ubuntu clang version 19.1.1 (1ubuntu1)"}
!142 = !DILocation(line: 0, scope: !2)
!143 = !DILocation(line: 10, column: 5, scope: !144)
!144 = distinct !DILexicalBlock(scope: !2, file: !3, line: 10, column: 5)
!145 = !DILocation(line: 12, column: 5, scope: !2)
